In [2]:
import pandas as pd
import numpy as np

In [4]:
d = {'type': ['A','A','B','B'], 'value': [10,14,12,23]}
df = pd.DataFrame(data=d)
df

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

In [10]:
df = pd.DataFrame(np.array([['A', 10], ['A',14]]), columns=['type', 'value'])
df

  type value
0    A    10
1    A    14

In [11]:
my_data = pd.DataFrame({"type": list("AABB"), "value": [10, 14, 12, 23]})
my_data

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

In [14]:
my_data = pd.DataFrame({
    'type': ['A'] * 2 + ['B'] * 2,
    'value': [10,14,12,23]
})
my_data

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

In [18]:
my_data = pd.DataFrame(
    data = [['A', 10],
            ['A', 14],
            ['B', 12],
            ['B', 23]],
    columns = ['type','value']
)
my_data

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

In [26]:
my_data = pd.DataFrame(np.array([['A',10], ['A',14],['B',12],['B',23]]), columns=['type', 'value'])  
my_data
#my_data.value.sum()
type(my_data['value'].iloc[0]) # тип строка, вместо числа

str

Шаг 3

In [30]:
# https://stepik.org/media/attachments/course/4852/my_stat.csv
df = pd.read_csv('my_stat.csv')
df.head()

   V1    V2 V3   V4
0   2  13.0  B  1.0
1  -1   7.0  B  1.0
2   0  11.0  A  0.0
3   2  11.0  A  2.0
4   0  10.0  B -1.0

In [68]:
# В переменную с именем subset_1 сохраните только первые 10 строк и только 1 и 3 колонку.
subset_1 = df[['V1','V3']].head(10)
subset_1.head()

   V1 V3
0   2  B
1  -1  B
2   0  A
3   2  A
4   0  B

In [69]:
#В переменную с именем subset_2 сохраните все строки кроме 1 и 5 и только 2 и 4 колонку.
subset_2 = df.iloc[:,[1,3]].drop([0,4])
subset_2.head()

     V2   V4
1   7.0  1.0
2  11.0  0.0
3  11.0  2.0
5  11.0  0.0
6   9.0  2.0

In [123]:
# negate with tilda ~
bad = df.index.isin([1,3])
#df[~bad].head()
df.loc[3:5].append(df.loc[11:13])

    V1    V2 V3   V4
3    2  11.0  A  2.0
4    0  10.0  B -1.0
5    2  11.0  A  0.0
11  -2  10.0  A  1.0
12   0   8.0  B  0.0
13   1  12.0  A  3.0

Шаг 4
Теперь потренируемся отбирать нужные нам наблюдения (строки), соответствующие некому условию. В dataframe с именем my_stat четыре колонки V1, V2, V3, V4:

В переменную subset_1 сохраните только те наблюдения, у которых значения переменной V1  строго больше 0, и значение переменной V3  равняется 'A'.

В переменную  subset_2  сохраните только те наблюдения, у которых значения переменной V2  не равняются 10, или значения переменной V4 больше или равно 1.

Как и в предыдущей задаче результат фильтрации - это тоже dataframe.

Фильтрацию данных можно осуществить разными способами, например так (https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.query.html?highlight=query)

или так (https://stackoverflow.com/questions/22086116/how-do-you-filter-pandas-dataframes-by-multiple-columns).

In [142]:
(df['V1'] > 0).head()

0     True
1    False
2    False
3     True
4    False
Name: V1, dtype: bool

In [143]:
(df['V3'] == 'A').head()

0    False
1    False
2     True
3     True
4    False
Name: V3, dtype: bool

In [151]:
((df['V1'] > 0) | (df['V3'] == 'A')).head()

0     True
1    False
2     True
3     True
4    False
dtype: bool

In [181]:
#df[(df['V1'] > 0) | (df['V3'] == 'A')].head()
subset_1 = my_stat[(my_stat['V1'] > 0) & (my_stat['V3'] == 'A')]
df.head()

NameError: name 'my_stat' is not defined

Шаг 5
Теперь давайте преобразуем наши данные. В переменной my_stat лежат данные с котороыми вам необходимо проделать следующее дейтвие. В этих данных (my_stat) создайте две новые переменных:

V5 = V1 + V4

V6 = натуральный логарифм переменной V2

Где найти натуральный логарифм?

In [164]:
df = pd.read_csv('my_stat.csv')
#df.query('V2 != 10 | V4 >= 1')
df.head()

   V1    V2 V3   V4
0   2  13.0  B  1.0
1  -1   7.0  B  1.0
2   0  11.0  A  0.0
3   2  11.0  A  2.0
4   0  10.0  B -1.0

In [172]:
df['V5'] = df['V1'] + df['V4']
df['V6'] = np.log(df['V2'])
df.head()

   V1    V2 V3   V4   V5        V6
0   2  13.0  B  1.0  3.0  2.564949
1  -1   7.0  B  1.0  0.0  1.945910
2   0  11.0  A  0.0  0.0  2.397895
3   2  11.0  A  2.0  4.0  2.397895
4   0  10.0  B -1.0 -1.0  2.302585

In [179]:
df.eval('V7 = V1+V4', inplace=True)
#df['V6'] = np.log(df['V2'])
df.head()

   V1    V2 V3   V4   V5        V6   V7
0   2  13.0  B  1.0  3.0  2.564949  3.0
1  -1   7.0  B  1.0  0.0  1.945910  0.0
2   0  11.0  A  0.0  0.0  2.397895  0.0
3   2  11.0  A  2.0  4.0  2.397895  4.0
4   0  10.0  B -1.0 -1.0  2.302585 -1.0

In [182]:
import numpy as np
rng = np.random.RandomState(42)
x = rng.rand(1000000)
y = rng.rand(1000000)
%timeit x + y

4.25 ms ± 47.2 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

Шаг 6
Отличная работа, закрепим еще пару важных вопросов и можно двигаться дальше.

Переменные V1, V2  ... такие имена никуда не годятся. С такими названиями легко запутаться в собственных данных и в результате ошибиться в расчетах.

Переименуйте колонки в данных  my_stat следующим образом:

V1 -> session_value

V2 -> group

V3 -> time

V4 -> n_users

In [207]:
df = pd.read_csv('my_stat.csv')
df.rename({
    'V1':'session_value',
    'V2':'group',
    'V3':'time',
    'V4':'n_users'
}, axis='columns', inplace=True)
df.shape

(500, 4)

Шаг 7
И напоследок давайте разберемся, как заменять наблюдения в данных.

В dataframe с именем my_stat сохранены данные с 4 колонками: session_value, group, time, n_users.  

В переменной session_value замените все пропущенные значения на нули.

В переменной n_users замените все отрицательные значения на медианное значение переменной n_users (без учета отрицательных значений, разумеется).

Как получить медиану переменной n_users без учета отрицательных значений? Если не придумали решения, подсказка - ищите один из возможных ответов в задачах, которые мы уже решили.

Данные для тренировки.

In [316]:
df = pd.read_csv('my_stat_1.csv')
#df
df.fillna({'session_value':0}, axis=0, inplace=True)
m = df[df['n_users'] >= 0]['n_users'].median()
#print(m)
idx = df.query('n_users < 0').index
#idx
df.loc[idx,'n_users'] = m
#type(df.time[0])
df

   session_value  time group  n_users
0            0.0    12     B      9.0
1            0.0    11     A      5.0
2            1.0     8     A      1.0
3            2.0     9     B      3.0
4            2.0    10     B      9.0
5            3.0     8     A      8.0
6            0.0    11     B      5.0
7            0.0     9     A      4.0
8            0.0     8     B      5.0
9            0.0     9     A      5.0

Шаг 8
Чуть не забыли, никакой анализ данных не обходится без агрегации наблюдений.
Напомню, в pandas с этим нам поможет связка  groupby + некоторое преобразование. Например:

число наблюдений в каждой группе
df.groupby('group_var').count()
Для того, что бы сгруппировать данные по нескольким переменным, используем список с нужными именами:

df.groupby(['group_var_1', 'group_var_2']).count()
Обратите внимание, что при такой записи группирующие переменные станут индексами в итоговом dataframe, изучите справку по groupby, чтобы разобраться со всеми тонкостями группировки данных. Также функция count() применится ко всем колонкам, что не всегда является желанным результатом. Чтобы применить функцию только к нужной колонке в данных, можно использовать связку  groupby() + agg()

my_stat.groupby('group').agg({'n_users': 'count'})
В этой задаче для данных my_stat рассчитайте среднее значение переменной session_value для каждой группы (переменная group), в получившемся dataframe  переменная group не должна превратиться в индекс. Также переименуйте колонку со средним значением session_value в mean_session_value.

Получившийся результат сохраните в dataframe с именем mean_session_value_data.

In [457]:
df = pd.read_csv('my_stat_1.csv')
#df2 = df.groupby('group', as_index=False).agg({'session_value':'mean'}).rename(index=str, columns={'session_value': 'mean_session_value'})
#df2
df2 = df.groupby('group', as_index=False).session_value.mean().rename(index=str, columns={'session_value': 'mean_session_value'})
df2
#df.rename({'session_value':'mean_session_value'}, axis='columns', inplace=True)
#df

  group  mean_session_value
0     A                 1.0
1     B                 1.0